**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [1]:
import pandas as pd
import numpy as  np

data = {
    'labels' : ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'],
    'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills',
              'spoonbills'],
    'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
    'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no'],}


birds1 = pd.DataFrame(data)
birds = birds1.set_index('labels')
print(birds)

             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
b           Cranes  4.0       4      yes
c          plovers  1.5       3       no
d       spoonbills  NaN       4      yes
e       spoonbills  6.0       3       no
f           Cranes  3.0       4       no
g          plovers  5.5       2       no
h           Cranes  NaN       2      yes
i       spoonbills  8.0       3       no
j       spoonbills  4.0       2       no

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [46]:
birds.describe(include = 'all')

         birds       age     visits priority
count       10  8.000000  10.000000       10
unique       3       NaN        NaN        2
top     Cranes       NaN        NaN       no
freq         4       NaN        NaN        6
mean       NaN  4.437500   2.900000      NaN
std        NaN  2.007797   0.875595      NaN
min        NaN  1.500000   2.000000      NaN
25%        NaN  3.375000   2.000000      NaN
50%        NaN  4.000000   3.000000      NaN
75%        NaN  5.625000   3.750000      NaN
max        NaN  8.000000   4.000000      NaN

**3. Print the first 2 rows of the birds dataframe **

In [ ]:
birds.iloc[0:2]

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [ ]:
birds[['birds','age']]

In [ ]:
birds.head(10)

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [5]:
birds1.loc[[2,3,7], ['birds','age','visits']]          

# code guidance courtesy https://www.youtube.com/watch?v=xvpNA7bC8cs

        birds  age  visits
2     plovers  1.5       3
3  spoonbills  NaN       4
7      Cranes  NaN       2

**6. select the rows where the number of visits is less than 4**

In [16]:
birds[birds.visits < 4]

             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
c          plovers  1.5       3       no
e       spoonbills  6.0       3       no
g          plovers  5.5       2       no
h           Cranes  NaN       2      yes
i       spoonbills  8.0       3       no
j       spoonbills  4.0       2       no

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [14]:
birds2 = birds1[birds1['age'].isnull()]
birds2[['birds','visits']]

        birds  visits
3  spoonbills       4
7      Cranes       2

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [39]:
birds3 = birds1[birds1.age < 4]
birds3[birds3.birds == 'Cranes']

  labels   birds  age  visits priority
0      a  Cranes  3.5       2      yes
5      f  Cranes  3.0       4       no

**9. Select the rows the age is between 2 and 4(inclusive)**

In [45]:
birds1[birds1['age'].between(2, 4)]

  labels       birds  age  visits priority
0      a      Cranes  3.5       2      yes
1      b      Cranes  4.0       4      yes
5      f      Cranes  3.0       4       no
9      j  spoonbills  4.0       2       no

**10. Find the total number of visits of the bird Cranes**

In [52]:
birds4 = birds[(birds['birds'] == 'Cranes')]
print(birds4)
print((birds4['visits']).sum())

         birds  age  visits priority
labels
a       Cranes  3.5       2      yes
b       Cranes  4.0       4      yes
f       Cranes  3.0       4       no
h       Cranes  NaN       2      yes
12

**11. Calculate the mean age for each different birds in dataframe.**

In [53]:
birds1[['age']].mean()

age    4.4375
dtype: float64

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [57]:
birds.loc['k'] = ['pegions', 2.0, 3, 'no']
print(birds)
print('\n')
birds = birds.drop('k')
print(birds)

             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
b           Cranes  4.0       4      yes
c          plovers  1.5       3       no
d       spoonbills  NaN       4      yes
e       spoonbills  6.0       3       no
f           Cranes  3.0       4       no
g          plovers  5.5       2       no
h           Cranes  NaN       2      yes
i       spoonbills  8.0       3       no
j       spoonbills  4.0       2       no
k          pegions  2.0       3       no


             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
b           Cranes  4.0       4      yes
c          plovers  1.5       3       no
d       spoonbills  NaN       4      yes
e       spoonbills  6.0       3       no
f           Cranes  3.0       4       no
g          plovers  5.5       2       no
h           Cranes  NaN       2      yes
i       spoonbills  8.0       3       no
j       spoonbills  4.0       2       no

**13. Find the number of each type of birds in dataframe (Counts)**

In [65]:
a = birds.groupby(['birds']).sum() 
a.drop(['age'], axis = 1)

            visits
birds
Cranes          12
plovers          5
spoonbills      12

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [70]:
a = birds.sort_values(['age'], ascending=[False]) 
print(a)
print('\n')
b = birds.sort_values(['visits'])
print(b)

             birds  age  visits priority
labels
i       spoonbills  8.0       3       no
e       spoonbills  6.0       3       no
g          plovers  5.5       2       no
b           Cranes  4.0       4      yes
j       spoonbills  4.0       2       no
a           Cranes  3.5       2      yes
f           Cranes  3.0       4       no
c          plovers  1.5       3       no
d       spoonbills  NaN       4      yes
h           Cranes  NaN       2      yes


             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
g          plovers  5.5       2       no
h           Cranes  NaN       2      yes
j       spoonbills  4.0       2       no
c          plovers  1.5       3       no
e       spoonbills  6.0       3       no
i       spoonbills  8.0       3       no
b           Cranes  4.0       4      yes
d       spoonbills  NaN       4      yes
f           Cranes  3.0       4       no

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [72]:
res = birds.replace(to_replace ='yes', 
                 value = 1)
res.replace(to_replace ='no', 
                 value = 0)

             birds  age  visits  priority
labels
a           Cranes  3.5       2         1
b           Cranes  4.0       4         1
c          plovers  1.5       3         0
d       spoonbills  NaN       4         1
e       spoonbills  6.0       3         0
f           Cranes  3.0       4         0
g          plovers  5.5       2         0
h           Cranes  NaN       2         1
i       spoonbills  8.0       3         0
j       spoonbills  4.0       2         0

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [73]:
birds.replace(to_replace = 'Cranes', value = 'Trumpeters')

             birds  age  visits priority
labels
a       Trumpeters  3.5       2      yes
b       Trumpeters  4.0       4      yes
c          plovers  1.5       3       no
d       spoonbills  NaN       4      yes
e       spoonbills  6.0       3       no
f       Trumpeters  3.0       4       no
g          plovers  5.5       2       no
h       Trumpeters  NaN       2      yes
i       spoonbills  8.0       3       no
j       spoonbills  4.0       2       no